# Language ecosystems:
brew "node@10", link: true
brew "python"
brew "python@2"
brew "lua"
brew "cocoapods" # XCode package manager
brew "watchman" # For fb react tools

# Standard util polyfills for mac:
brew "gnupg"
brew "libpng"

# Better Utils:
brew "neovim"
brew "ripgrep"
brew "fd"
brew "jq"
brew "tig"
brew "fzf"

# Service CLIs:
brew "hub" # GitHub
brew "awscli" # AWS
brew "docker-credential-helper-ecr" # Docker creds helper; make sure to update ~/.docker/config.json
