# Language ecosystems:
brew "node@12", link: true
brew "python"
brew "pyenv"
brew "lua"
brew "cocoapods" # XCode package manager
brew "watchman" # For fb react tools
brew "postgres"

# Standard util polyfills for mac:
brew "gnupg"
brew "libpng"

# Better Utils:
brew "neovim"
brew "ripgrep"
brew "fd"
brew "jq"
brew "tig"
brew "fzf"
brew "bat"
brew "git-delta"

# Service CLIs:
brew "hub" # GitHub
brew "awscli" # AWS
brew "docker-credential-helper-ecr" # Docker creds helper; make sure to update ~/.docker/config.json

# Pilot deps:
brew "openssl@1.1"
brew "pinentry-mac"
