# Allow things from homebrew core or casks
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
cask_args appdir: "/Applications", require_sha: true

# User software
cask "chromium"
cask "inkscape"
cask "krita"

# Language ecosystems:
brew "node@16", link: true
brew "python"
brew "pyenv"
brew "lua"
brew "postgres"
brew "shellcheck"
brew "terraform"
brew "yarn"

# Standard util polyfills for mac:
brew "gnupg"
brew "libpng"

# Better Utils:
brew "neovim"
brew "ripgrep"
brew "fd"
brew "jq"
brew "tig"
brew "fzf"
brew "bat"

# Service CLIs:
brew "gh" # GitHub new
brew "hub" # GitHub legacy
brew "awscli" # AWS
brew "docker-credential-helper-ecr" # Docker creds helper; make sure to update ~/.docker/config.json
